'********************************************************
'Урок VBScript №9:
'Строковые функции. Работа с текстом
'file_1.vbs
'********************************************************
'Начальный Символ — Отступ поиска...
'Строка1 — строка в которой ищем
'Строка2 — строка которую ищем
'Сравнение — учитывать или не учитывать регистр. _
'Да — 0 = vbBinaryCompare, Нет — 1 = vbTextCompare. По умолчанию 0.
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
MsgBox _
	"Ищем символ с начала строки с символа номер 1" &  vbCrlf & _
	"123456" &  vbCrlf & _
	"abcdef" &  vbCrlf & _
	"abc^" &  vbCrlf & _
	"InStr(1,""abcdef"",""d"")=" & InStr(1,"abcdef","d") & vbCrlf & _
"!!!"
MsgBox _
	"Ищем символ с начала строки с символа номер 5 - смотрите, не найдем" &  vbCrlf & _
	"123456" &  vbCrlf & _
	"abcdef" &  vbCrlf & _
	"abc^" &  vbCrlf & _
	"InStr(5,""abcdef"",""d"")=" & InStr(5,"abcdef","d") & vbCrlf & _
"!!!"
MsgBox _
	"Ищем символ с конца строки с символа номер 5 - смотрите,найдем" &  vbCrlf & _
	"123456" &  vbCrlf & _
	"abcdef" &  vbCrlf & _
	"abc^" &  vbCrlf & _
	"InStrRev(""abcdef"",""d"",5)=" & InStrRev("abcdef","d",5) & vbCrlf & _
"!!!"
MsgBox _
	"Ищем символ с конца строки с символа номер 5 - смотрите,не найдем" &  vbCrlf & _
	"123456" &  vbCrlf & _
	"abcdef" &  vbCrlf & _
	"abc^" &  vbCrlf & _
	"InStrRev(""abcdef"",""d"",3)=" & InStrRev("abcdef","d",3) & vbCrlf & _
"!!!"
MsgBox _
	"Ищем символ ...- смотрите,не найдем" &  vbCrlf & _
	"123456" &  vbCrlf & _
	"abcdef" &  vbCrlf & _
	"abc^" &  vbCrlf & _
	"InStrRev(""abcdef"",""D"",3)=" & InStrRev("abcdef","D",6,0) & vbCrlf & _
"!!!"
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''

''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''