'********************************************************
'Урок VBScript №9:
'Строковые функции. Работа с текстом
'file_2.vbs
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
'Строка — Понятно. Строка, с которой работаем.
'Начало — Номер символа, с которого начинаем
'Длина — Сколько символов вырезаем. Не обязательно.
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
Msgbox _
	"Вырезание части строки" &  vbCrlf & _
	"123456" &  vbCrlf & _
	"abcdef" &  vbCrlf & _
	Mid("abcdef",InStr(3,"abcdef","c",1)) &  vbCrlf &_
"!!!"
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
Msgbox _
	"Приводим К Верхнему регистру" &  vbCrlf & _
	LCase("Приводим К Нижнему регистру") &  vbCrlf & _
	UCase("Приводим К Верхнему регистру") &  vbCrlf & _
"!!!"
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
Msgbox _
	"abcdef" & vbCrlf & _
	"Выдрать символы с лева:" & Left("abcdef",3) & vbCrlf & _
	"Выдрать символы с права:" & Right("abcdef",3) & vbCrlf & _
"!!!"
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
Msgbox _
	"Удаляем пробелы " & vbCrlf & _
	"<  a b c d e f  >" & vbCrlf & _
	"LTrim(""  a b c d e f  "") =<" & LTrim("  a b c d e f  ") &">"& vbCrlf & _
	"Trim(""  a b c d e f  "") =<" & Trim("  a b c d e f  ") &">"& vbCrlf & _
	"RTrim(""  a b c d e f  "") =<" & RTrim("  a b c d e f  ") &">"& vbCrlf & _
"!!!"
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
Msgbox _
	"Заменяем кусок в тексте" & vbCrlf & _
	"VBHack.Ru лучший сайт!" & vbCrlf & _
	Replace("VBHack.Ru лучший сайт!","лучший","самый лучший") & vbCrlf & _
"!!!"
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
Msgbox _
	"Хочу 10 пробелов:<"&Space(10)&">" & vbCrlf & _
	"Хочу 10 десять восклицательных знаков:<"&String(10,"!")&">" & vbCrlf & _
"!!!"
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
Msgbox _
	"Сравниваем строки" & vbCrlf & _
	"Принцип работы - классический компанатор в котором 0 означает равно" & vbCrlf & _
	"StrComp(""12346"",""12345"")=" &StrComp("12346","12345")& vbCrlf & _
	"StrComp(""12345"",""1234"")=" &StrComp("12345","1234")& vbCrlf & _
	"StrComp(""12345"",""12345"")=" &StrComp("12345","12345")& vbCrlf & _
	"StrComp(""1234"",""12345"")=" &StrComp("1234","12345")& vbCrlf & _
	"StrComp(""12345"",""12346"")=" &StrComp("12345","12346")& vbCrlf & _
"!!!"
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
Msgbox _
	"Перестановка символов" & vbCrlf & _
	"унитаз" & vbCrlf & _
	StrReverse("унитаз") & vbCrlf & _
	"Len(""унитаз"")=" &Len("унитаз") & vbCrlf & _
	"Asc(""A"")=" & Asc("A") & vbCrlf & _ 
	"Chr(65)=" & Chr(65) & vbCrlf & _ 
"!!!"
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''