'”рок VBScript є7:
'‘ункци€ дл€ работы с датой и временем
'file_1.vbs
''''''''''''''''''''''''''''''''''''''''''''''''
MsgBox "Date = " & Date & vbCrLf &"Now = " & Now & vbCrLf & #12/05/2010# & vbCrLf & #15.05.10#
''''''''''''''''''''''''''''''''''''''''''''''''
MsgBox "–азница даты времени"& vbCrLf & "ѕрошло 72 часа = " & DateDiff("h", #08/03/2015#, #08/06/2015#)& vbCrLf & "ѕрошло 3 дн€ = " & DateDiff("d", "03/08/2015", "06/08/2015")
''''''''''''''''''''''''''''''''''''''''''''''''
MsgBox #08/03/2015#& vbCrLf & "+8 мес€цев"& vbCrLf & DateAdd("m", 8, #08/03/2015#) & vbCrLf  & "-8 мес€цев"& vbCrLf & DateAdd("m", -8, #08/03/2015#)
''''''''''''''''''''''''''''''''''''''''''''''''
MsgBox Now& vbCrLf &"m =" & DatePart("m", #08/03/2015#) & vbCrLf & "d =" & DatePart("d", #08/03/2015#) & vbCrLf & "q =" & DatePart("q", #08/03/2015#)
''''''''''''''''''''''''''''''''''''''''''''''''
MsgBox "„асы: " & Hour(Now) & vbCrLf & "ћинуты: " & Minute(Now) & vbCrLf & "ћес€ц: " & Month(Now) & vbCrLf & "ƒень: " & Day(Now) & vbCrLf & "√од: " & Year(Now) & vbCrLf & "¬рем€: " & TimeValue(Now)
''''''''''''''''''''''''''''''''''''''''''''''''
rem yyyy Ч год
rem q Ч квартал
rem m Ч мес€ц
rem y Ч номер дн€ в году
rem d Ч день
rem w Ч номер дн€ в неделе
rem ww Ч номер недели в году
rem h Ч час
rem n Ч минута
rem s Ч секунда
''''''''''''''''''''''''''''''''''''''''''''''''